type IFaqText = {
    name: string,
    text: string
}
export const faqText:IFaqText[] = [{
name:'Какова стоимость доставки заказов в интернет-магазине?', 
text:`Электронные сигареты изобретенные вначале 2003 года помогли уже миллионам людей 
отказаться от аналогового курения. Сейчас вейпинг не просто отказ от курения, а целая культура, 
имеющая в своем арсенале десятки миллионов поклонников во всем мире. Людей с 
электронками можно встретить везде как рядом с метро так и в дорогом загородном клубе.
Главное преимущество электронного парения - менее вредный пар, как для людей, 
которые используют вейп так и для окружающих. Также, он привлекает своим изобилием вкусов и удобством перед кальяном.
Если Вы курите сигареты, и хотите избавиться от этой привычки, обязательно советуем Вам посетить наш 
вейп шоп в Киеве. Ведь процесс парения не только более здоровый, но и очень приятный. Заботясь о здоровье 
своих граждан, большая часть Евросоюза выступили в поддержку перехода с аналоговых сигарет на электронные. 
Также, эта привычка экономит Ваш бюджет. Один раз скупиться в вейп-шопе выходит намного выгоднее чем 
ежедневные покупки в ларьках с сигаретами.
`},
{
    name:'Какова стоимость доставки заказов в интернет-магазине?', 
    text:`Электронные сигареты изобретенные вначале 2003 года помогли уже миллионам людей 
    отказаться от аналогового курения. Сейчас вейпинг не просто отказ от курения, а целая культура, 
    имеющая в своем арсенале десятки миллионов поклонников во всем мире. Людей с 
    электронками можно встретить везде как рядом с метро так и в дорогом загородном клубе.
    Главное преимущество электронного парения - менее вредный пар, как для людей, 
    которые используют вейп так и для окружающих. Также, он привлекает своим изобилием вкусов и удобством перед кальяном.
    Если Вы курите сигареты, и хотите избавиться от этой привычки, обязательно советуем Вам посетить наш 
    вейп шоп в Киеве. Ведь процесс парения не только более здоровый, но и очень приятный. Заботясь о здоровье 
    своих граждан, большая часть Евросоюза выступили в поддержку перехода с аналоговых сигарет на электронные. 
    Также, эта привычка экономит Ваш бюджет. Один раз скупиться в вейп-шопе выходит намного выгоднее чем 
    ежедневные покупки в ларьках с сигаретами.
    `},
    {
        name:'Какова стоимость доставки заказов в интернет-магазине?', 
        text:`Электронные сигареты изобретенные вначале 2003 года помогли уже миллионам людей 
        отказаться от аналогового курения. Сейчас вейпинг не просто отказ от курения, а целая культура, 
        имеющая в своем арсенале десятки миллионов поклонников во всем мире. Людей с 
        электронками можно встретить везде как рядом с метро так и в дорогом загородном клубе.
        Главное преимущество электронного парения - менее вредный пар, как для людей, 
        которые используют вейп так и для окружающих. Также, он привлекает своим изобилием вкусов и удобством перед кальяном.
        Если Вы курите сигареты, и хотите избавиться от этой привычки, обязательно советуем Вам посетить наш 
        вейп шоп в Киеве. Ведь процесс парения не только более здоровый, но и очень приятный. Заботясь о здоровье 
        своих граждан, большая часть Евросоюза выступили в поддержку перехода с аналоговых сигарет на электронные. 
        Также, эта привычка экономит Ваш бюджет. Один раз скупиться в вейп-шопе выходит намного выгоднее чем 
        ежедневные покупки в ларьках с сигаретами.
        `},
        {
            name:'Какова стоимость доставки заказов в интернет-магазине?', 
            text:`Электронные сигареты изобретенные вначале 2003 года помогли уже миллионам людей 
            отказаться от аналогового курения. Сейчас вейпинг не просто отказ от курения, а целая культура, 
            имеющая в своем арсенале десятки миллионов поклонников во всем мире. Людей с 
            электронками можно встретить везде как рядом с метро так и в дорогом загородном клубе.
            Главное преимущество электронного парения - менее вредный пар, как для людей, 
            которые используют вейп так и для окружающих. Также, он привлекает своим изобилием вкусов и удобством перед кальяном.
            Если Вы курите сигареты, и хотите избавиться от этой привычки, обязательно советуем Вам посетить наш 
            вейп шоп в Киеве. Ведь процесс парения не только более здоровый, но и очень приятный. Заботясь о здоровье 
            своих граждан, большая часть Евросоюза выступили в поддержку перехода с аналоговых сигарет на электронные. 
            Также, эта привычка экономит Ваш бюджет. Один раз скупиться в вейп-шопе выходит намного выгоднее чем 
            ежедневные покупки в ларьках с сигаретами.
            `}]